# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2023-04-19 23:03:27 krylon>
#
#+TAGS: optimize(o) refactor(r) bug(b) feature(f) architecture(a)
#+TAGS: web(w) database(d) javascript(j)
#+TODO: TODO(t) IMPLEMENT(i) TEST(e) RESEARCH(r) | DONE(d)
#+TODO: MEDITATE(m) PLANNING(p) REFINE(n) | FAILED(f) CANCELLED(c) SUSPENDED(s)
#+TODO: EXPERIMENT(x) |
#+PRIORITIES: A G D

* pkman
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 20
   #+CAPTION: Clock summary at [2023-04-19 Mi 23:03]
   | Headline                        | Time    |       |       |       |
   |---------------------------------+---------+-------+-------+-------|
   | *Total time*                    | *12:34* |       |       |       |
   |---------------------------------+---------+-------+-------+-------|
   | pkman                           | 12:34   |       |       |       |
   | \_  Components [0/0]            |         | 12:34 |       |       |
   | \_    Package managers [0/1]    |         |       | 12:34 |       |
   | \_      Detect operating system |         |       |       | 12:34 |
   #+END:
** Diary
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    I want to keep track of some things, most importantly /when/ updates are
    installed. Also, when packages are installed, deleted, etc. Eventually,
    I'd like to provide a nice interface to do something with that data.
    I'll probably end up using SQLite again. But that is not final.
*** CLI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    Among the various package managers I am familiar with, I most like the
    interfaces offered by zypper on openSuse and pkg on FreeBSD.
*** Operations [0/6]
    It would probably best to define which operations I want to expose.
    I will probably want to add more as I go along.
    - [ ] Update package repos
    - [ ] Search packages
    - [ ] Install packages
    - [ ] Remove packages
    - [ ] Install updates
    - [ ] List installed packages
    - [ ] Clean up
*** Package managers [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
**** TODO Detect operating system
     :LOGBOOK:
     CLOCK: [2023-04-19 Mi 15:56]--[2023-04-19 Mi 23:03] =>  7:07
     CLOCK: [2023-04-18 Di 20:32]--[2023-04-18 Di 23:59] =>  3:27
     CLOCK: [2023-04-18 Di 14:28]--[2023-04-18 Di 14:56] =>  0:28
     CLOCK: [2023-04-17 Mo 21:10]--[2023-04-17 Mo 22:28] =>  1:18
     CLOCK: [2023-04-17 Mo 10:36]--[2023-04-17 Mo 10:50] =>  0:14
     :END:
**** APT
**** dnf
**** zypper
**** pacman
**** pkg FreeBSD
**** pkg_* OpenBSD
** Bugs
